app/views/profiles/index.html.erb

  <tr>
    <td><%= @editors.find{|e| e.id == profile.editor_id}.email %></td>
---
SELECT "editors".* FROM "editors" WHERE ("editors"."id" = 1) LIMIT 1