app/views/profiles/show.html.erb

  <b>Editor:</b>
  <%= @editors.find{|e| e.id == @profile.editor_id}.email %>
---
SELECT "editors".* FROM "editors" WHERE ("editors"."id" = 1) LIMIT 1