app/views/articles/index.html.erb

SELECT "categories".* FROM "categories"
SELECT "editors".* FROM "editors" WHERE ("editors"."id" = 1) LIMIT 1
---
    <div id="byline">
	Category: <%=h @categories.find{ |c| c.id == article.category_id}.name %> |
	Posted : <%= article.created_at%> by
	<%= @editors.find{|a| a.id == article.editor_id}.email %></div>