app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) AS count_id FROM "articles"
SELECT "categories".* FROM "categories"
SELECT "editors".* FROM "editors" LIMIT 1
---
   def index
     @articles = Article.paginate :page => params[:page], :order => 'created_at DESC'
     @categories = Category.all
	 @editors = Editor.all

SELECT "categories".* FROM "categories"
SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 1) LIMIT 1
SELECT "editors".* FROM "editors"
---
  def show
    @categories = Category.all
    @article = Article.find(params[:id])
	@editors = Editor.all

SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 1) LIMIT 1
---
  def edit
    @categories = Category.all
    @article = Article.find(params[:id])

SELECT "categories".* FROM "categories"
INSERT INTO "articles" ("category_id", "content", "created_at", "title", "updated_at") VALUES (2, '<p><span style="font-family: Arial, Helvetica, sans; font-size: 11px; line-height: 14px;">Lorem ipsum dolor sit amet, consectetur adipiscing elit. Maecenas blandit diam eget nisi cursus varius. Praesent condimentum facilisis tellus sed scelerisque. Curabitur lobortis scelerisque mollis. Ut tincidunt rutrum ullamcorper. Proin vel imperdiet eros. In cursus lobortis nisl consequat consequat. Morbi ultricies rutrum odio a porta. Etiam a ipsum urna. Praesent convallis, ligula vel rutrum pretium, massa felis dignissim nisi, et feugiat mauris felis sit amet orci. In viverra, orci sed fringilla aliquam, odio massa mattis purus, et dapibus metus urna et urna. Nunc interdum, diam ut adipiscing dapibus, neque purus pulvinar velit, nec vehicula est neque eu diam. Etiam vitae neque id felis pharetra cursus. Nulla metus lorem, dictum at consequat sit amet, porta a augue. Etiam eleifend imperdiet ligula id pretium. Suspendisse potenti. Nunc id vehicula est. Donec ullamcorper laoreet varius. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Mauris ut est eros, sed pharetra dui. Etiam id enim nibh, nec placerat justo.</span></p>', '2011-02-06 16:56:18.785574', 'Title 1', '2011-02-06 16:56:18.785574')
---
  def create
    params[:article][:editor_id] = current_editor.id
    @categories = Category.all
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save

SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 1) LIMIT 1
UPDATE "articles" SET "content" = '<p>asdadasdaksdjaslkdjalskdalkjsdlkajsdlkjaksldjaksdjlakjdslakjsdlajdlajsdlkajdl</p>
---
  def update
    @categories = Category.all
    @article = Article.find(params[:id])

    respond_to do |format|
	  if( current_editor.id == @article.editor_id)
		if @article.update_attributes(params[:article])

SELECT "categories".* FROM "categories"
SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 1) LIMIT 1
DELETE FROM "articles" WHERE ("articles"."id" = 4)
---
  def destroy
    @categories = Category.all
    @article = Article.find(params[:id])
	if( current_editor.id == @article.editor_id)
	  @article.destroy