app/controllers/categories_controller.rb

  def index
    @categories = Category.all
	@editors = Editor.all
---
SELECT "categories".* FROM "categories"
SELECT "editors".* FROM "editors"

  def show
    @category = Category.find(params[:id])
	@editors  = Editor.all
---
SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1
SELECT "editors".* FROM "editors"

  def edit
    @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1

  def create
    params[:category][:editor_id] = current_editor.id
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("created_at", "editor_id", "name", "updated_at") VALUES ('2011-02-07 17:27:10.789981', NULL, 'asdas', '2011-02-07 17:27:10.789981')

  def update
    @category = Category.find(params[:id])

    respond_to do |format|
	  if( current_editor.id == @category.editor_id)
		if @category.update_attributes(params[:category])
---
SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1
UPDATE "categories" SET "name" = 'asdas354', "updated_at" = '2011-02-07 18:14:52.338780' WHERE ("categories"."id" = 1)

  def destroy
    @category = Category.find(params[:id])
	if( current_editor.id == @category.editor_id)
      @category.destroy
---
SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1
DELETE FROM "categories" WHERE ("categories"."id" = 1)