app/controllers/profiles_controller.rb

  def index
    @profiles = Profile.all
	@editors  = Editor.all
---
SELECT "profiles".* FROM "profiles"
SELECT "editors".* FROM "editors"

  def show
    @profile = Profile.find(params[:id])
	@editors = Editor.all
---
SELECT "profiles".* FROM "profiles" WHERE ("profiles"."id" = 2) LIMIT 1
SELECT "editors".* FROM "editors"

  def edit
    @profile = Profile.find(params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE ("profiles"."id" = 2) LIMIT 1

  def update
    @profile = Profile.find(params[:id])

    respond_to do |format|
	  if( current_editor.id == @profile.editor_id)
		if @profile.update_attributes(params[:profile])
---
SELECT "profiles".* FROM "profiles" WHERE ("profiles"."id" = 2) LIMIT 1
UPDATE "profiles" SET "content" = '<p>askldjaslkdjf</p>', "title" = ' dasjdaslj', "updated_at" = '2011-02-15 14:26:22.570673' WHERE ("profiles"."id" = 1)

  def destroy
    @profile = Profile.find(params[:id])
    @profile.destroy
---
SELECT "profiles".* FROM "profiles" WHERE ("profiles"."id" = 1) LIMIT 1
DELETE FROM "profiles" WHERE ("profiles"."id" = 1)