app/views/categories/index.html.erb

    <td><%=h category.name %></td>
    <td><%=h @editors.find{|e| e.id == category.editor_id}.email %></td>
---
SELECT "editors".* FROM "editors" WHERE ("editors"."id" = 1) LIMIT 1