app/views/categories/show.html.erb

SELECT "editors".* FROM "editors" WHERE ("editors"."id" = 1) LIMIT 1
---
   <b>Author:</b>
   <%=h @editors.find{|e| e.id == @category.editor_id}.email %>